---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingType
source: html/808808c3-841e-ba74-c5ed-17e8d788f024.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingType Property

The type of building.

## Syntax (C#)
```csharp
public gbXMLBuildingType BuildingType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The building type does not fall within an appropriate range.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration